experiments/closed_vs_open_wrk2/default/results/20260528-235123/closed_sweep1_50rps_0iter.log
Running 5m test @ http://frontend.default.svc.cluster.local:5000
  32 threads and 32 connections
  Thread calibration: mean lat.: 9.051ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 7.167ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 4.972ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 6.201ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.676ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 8.103ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 8.768ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.370ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 7.674ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.709ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.794ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.095ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.826ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.797ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.871ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.963ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.286ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 4.969ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.917ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 7.977ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 6.781ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 5.854ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.019ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 6.252ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.154ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.462ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.631ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 10.898ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 6.458ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 8.477ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.083ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.49ms    4.36ms  19.66ms   79.82%
    Req/Sec     1.01      7.53    45.00     97.99%
  9524 requests in 5.00m, 3.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 663
Requests/sec:     31.74
Transfer/sec:     13.36KB